In [1]:
import seaborn as sns

In [3]:
df=sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [10]:
mean_price = df.groupby('time')['total_bill'].mean()
mean_price

C:\Users\behli\AppData\Local\Temp\ipykernel_24528\576415896.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  mean_price = df.groupby('time')['total_bill'].mean()

time
Lunch     17.168676
Dinner    20.797159
Name: total_bill, dtype: float64

In [11]:
df['total_bill_mean']=df['time'].map(mean_price)

In [ ]:
df[['total_bill','total_bill_mean ']]

     total_bill total_bill_mean
0         16.99       20.797159
1         10.34       20.797159
2         21.01       20.797159
3         23.68       20.797159
4         24.59       20.797159
..          ...             ...
239       29.03       20.797159
240       27.18       20.797159
241       22.67       20.797159
242       17.82       20.797159
243       18.78       20.797159

[244 rows x 2 columns]